Repository: eldesh/coq_ja_work
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: The generation of the graph relation (`R_ident`) used to compute the induction scheme of ident raised a typing error.
ja: ident の帰納法の原理を算出するのに使われるグラフ関係 (`R_ident`) の生成は型付けエラーを発生します。

source: The identifiers inside the brackets are the names of fields.
ja: ブラケットの中の識別子はフィールド名です。

source: The implementation simply declares each projection as an instance.
ja: その実装は単純に各射影をインスタンスとして定義するものです。

source: The inductive `R_ident` corresponding to the graph of `ident` (silently);
ja: 帰納的 `R_ident` は (暗黙に) `ident` のグラフに対応します。

source: The inner theory module contains the overloaded notation ``==`` and will eventually contain lemmas holding all the instances of the algebraic structure (in this case there are no lemmas).
ja: 内部のtheoryモジュールはオーバーロードされた記法 ``==`` を含み、その代数構造の全てのインスタンスを保持する補題をも含みます (この場合は補題はありません)。

source: The interactive mode is generally run with the help of an IDE, such as CoqIDE, documented in :ref:`coqintegrateddevelopmentenvironment`, Emacs with Proof-General :cite:`Asp00` [#PG]_, or jsCoq to run Coq in your browser (see https://github.com/ejgallego/jscoq).
ja: 対話モードは一般的に, CoqIDE (:ref:`coqintegrateddevelopmentenvironment` にて記載)やProof-General :cite:`Asp00` [#PG]_ を入れた Emacs 、またはブラウザ上で動作する jsCoq (https://github.com/ejgallego/jscoq) のようなIDEの助けを借りて実行されます。

source: The interested reader shall also find in :cite:`CSlessadhoc` a detailed description of another, complementary, use of canonical structures: advanced proof search.
ja: 興味のある読者は :cite:`CSlessadhoc` にも別の、相補的な、正準構造の使用: 高度な証明探索 についての詳細な説明を発見するでしょう。

source: The language
ja: 言語

source: The language to combine these tactics into complex proof strategies is given in Chapter :ref:`ltac`.
ja: これらのタクティックを組み合わせて複雑な証明戦略を作るための言語については :ref:`ltac` の章で述べています。

source: The lemma `ident`\ :math:`_{\sf tcc}` which collects all proof obligations in one property;
ja: 補題 `ident`\ :math:`_{\sf tcc}` これは全ての証明課題を集めて一つの性質にします。

source: The lemmas `ident`\ :math:`_{\sf terminate}` and `ident`\ :math:`_{\sf F}` which is needed to be inlined during extraction of ident.
ja: 補題 `ident`\ :math:`_{\sf terminate}` と `ident`\ :math:`_{\sf F}` これは indent のエクストラクションをする間にインライン化するために必要となります。

source: The macro generates also, when it is possible, the projection functions for destructuring an object of type `\ident`.
ja: そのマクロはさらに、それが可能な時は `\ident` 型のオブジェクトをデストラクトするための射影関数をも生成します。

source: The main differences are the following:
ja: 主な違いは以下です:

source: The meaning of this declaration is to define a function ident, similarly to ``Fixpoint`.
ja: この定義の意味は関数 ident を定義することで、``Fixpoint`` に似ています。

source: The mixin component of the ``LEQ`` class contains all the extra content we are adding to ``EQ`` and ``LE``.
ja: ```LEQ``` クラスの構成部品 mixin は ``EQ`` と ``LE`` に追加している特別な内容を全て含んでいます.

source: The module ``Recdef`` of the standard library must be loaded for this feature.
ja: この機能を使うには標準ライブラリの ``Recdef`` モジュールがロードされていないといけません。

source: The name `ident` already exists in the environment (see :cmd:`Axiom`).
ja: 名前 `ident` が既に環境中に存在する (:cmd:`Axiom` 参照)。

source: The new command works similarly to the :cmd:`Variables` vernacular, except it accepts any binding context as argument.
ja: その新しいコマンドはどんな束縛コンテキストでも引数として受け入れるということを除き、:cmd:`Variables` Vernacular と同じように動作します。

source: The object ``Pack`` takes a type ``T`` (the key) and a mixin ``m``.
ja: オブジェクト ``Pack`` は型 ``T`` (キー) と mixin ``m`` を取ります。

source: The odd arguments ``_`` and ``id`` we pass to the packager represent respectively the classes to be inferred (like ``e``, ``o``, etc) and a token (``id``) to force their inference.
ja: packager に渡した奇妙な引数 ``_`` と ``id`` はそれぞれ推論されるべきクラス (``e`` や ``o`` その他) とそれらの推論を強制するためのトークン (``id``) を表します。

source: The optional identifier following ``:=`` is the name of its constructor.
ja: ``:=`` に続くオプショナルな識別子はそのコンストラクタです。

source: The order must be well-founded.
ja: その順序は整礎でなければなりません。

source: The other utilities are used to ask |Coq| to solve a specific unification problem, that will in turn require the inference of some canonical structures.
ja: 他のユーティリティは |Coq| に正準構造の推論を必要とすることになるであろう特定的な単一化問題を解くように要求するのに使われます。

source: The parameters of the subclass contain at least all the parameters of its superclasses in their order of appearance (here A is the only one).
ja: サブクラスのパラメータは少なくともそのスーパークラスのパラメータ全てをそれらの出現順で含みます (ここでは A ただ一つです)。

source: The point of the {} annotation is to name the decreasing argument *and* to describe which kind of decreasing criteria must be used to ensure termination of recursive calls.
ja: {} 注釈のポイントは減少する引数に名前をつけること *そして* 再帰呼び出しの停止性を保証するためにどの種類の減少基準を使うべきなのかを説明することです。

source: The problem is that the two classes ``LE`` and ``LEQ`` are not yet related by a subclass relation.
ja: 問題は ``LE`` と ``LEQ`` という二つのクラスが未だにサブクラス関係によって関連付いてないことです。

source: The proof engine
ja: 証明エンジン

source: The record name `ident` appears in the type of its fields, but uses the keyword ``Record``.
ja: レコード名 `ident` がそのフィールドの型の中に現れているが、``Record`` キーワードを使っています。

source: The same objects as above;
ja: 上と同じオブジェクト。

source: The same objects as with the struct;
ja: struct を用いたときと同じオブジェクト;

source: The second part describes the proof engine.
ja: 第2部では、証明エンジンについて説明します。

source: The semantics for the limit :n:`@num` is different than for auto.
ja: :n:`@num` 制限の意味は auto と異なります。

source: The semantics of the options are:
ja: オプションの意味は:

source: The set of rational numbers may be defined as:
ja: 有理数の集合は以下のように定義されるかもしれません:

source: The syntax ``:>`` indicates that each ``PreOrder`` can be seen as a ``Reflexive`` relation.
ja: ``:>`` 構文は ``PreOrder`` それぞれが ``Reflexive`` 関係と見なせることを示しています。

source: The syntax for class and instance declarations is the same as the record syntax of Coq:
ja: クラスとインスタンスの宣言の構文は Coq のレコード構文と同じです:

source: The tactic ``autoapply`` applies a term using the transparency information of the hint database ident, and does *no* typeclass resolution.
ja: タクティック ``autoapply`` はヒントデータベース ident の透過性情報を使用し term を適用し、型クラス解決は *行いません*。

source: The third part describes how to extend the syntax of |Coq| in Chapter :ref:`syntaxextensionsandinterpretationscopes` and how to define new induction principles in Chapter :ref:`proofschemes`.
ja: 第3部は、 :ref:`syntaxextensionsandinterpretationscopes` の章で|Coq| の構文の拡張方法を、 :ref:`proofschemes` の章で帰納法の原理を新たに定義する方法を説明しています。

source: The transparency information of databases is used consistently for all hints declared in them.
ja: データベースの透過性情報はそれらの中で定義された全てのヒントと一貫して使用されます。

source: The type of the projections `ident` depends on previous projections which themselves could not be defined.
ja: `ident` の射影の型がそれ自身の以前の射影に依存していると定義できません。

source: The underlying formal language of |Coq| is a *Calculus of Inductive Constructions* (|Cic|) whose inference rules are presented in this chapter.
ja: |Coq| の基礎となる形式言語は *Calculus of Inductive Constructions* (|Cic|) と呼ばれる。この章では、 |Cic| の推論規則について説明する。

source: The use of the projection ``op`` requires its argument to be in the class ``EQ``, and uses such a member (function) to actually compare its arguments.
ja: 射影 ``op`` の使用はその引数が ``EQ`` クラスに属していることを要求し、そのようなメンバ (関数) を実際にその引数を比較するために使います。

source: The very heart of the |Coq| system is the type checking algorithm that checks the correctness of proofs, in other words that checks that a program complies to its specification.
ja: |Coq| システムの心臓部は型検査アルゴリズムで、これは証明の正しさを検査します。言い換えれば、このアルゴリズムはプログラムがその仕様に準拠するか検査します。

source: The way this recursive function is defined is the subject of several papers by Yves Bertot and Antonia Balaa on the one hand, and Gilles Barthe, Julien Forest, David Pichardie, and Vlad Rusu on the other hand.
ja: この方法により再帰関数が定義される方法は、一方で Yves Bertot と Antonia Balaa による、もう一方で Gilles Barthe、Julien Forest、David Pichardie、Vlad Rusu によるいくつかの論文の主題です。

source: The |Coq| standard library
ja: |Coq| 標準ライブラリ

source: The |Coq| system is designed to develop mathematical proofs, and especially to write formal specifications, programs and to verify that programs are correct with respect to their specifications.
ja: |Coq| は、数学的な証明を構築するためにデザインされました。特に、形式仕様やプログラムを記述したり、プログラムが仕様に沿っていることを検証することを目的としています。

source: The |p_i| ``:`` |t_i| variables are called the *parameters* of the class and the |f_i| ``:`` |t_i| are called the *methods*.
ja: 変数 |p_i| ``:`` |t_i| はクラスの *パラメータ* と呼ばれ、|f_i| ``:`` |t_i| は *メソッド* と呼ばれます。

source: Then the user is able to apply an object that is not a function, but can be coerced to a function, and more generally to consider that a term of type ``A`` is of type ``B`` provided that there is a declared coercion between ``A`` and ``B``.
ja: するとユーザは関数ではないが、関数にコアーションされるオブジェクトを適用することが出来、さらに一般的にはこう考えられる。ある項の型は ``A`` であり、``A`` と ``B`` の間に定義されたコアーションがあることで提供される型 ``B`` である。

source: Then, each time an equation of the form ``(``\ |x_i| ``_)`` |eq_beta_delta_iota_zeta| |c_i| has to be solved during the type checking process, :token:`qualid` is used as a solution.
ja: すると、型検査の過程でそれぞれ ``(``\ |x_i| ``_)`` |eq_beta_delta_iota_zeta| |c_i| という形の方程式を解く必要があり、:token:`qualid` が解として使えます。

source: Then, in Chapter :ref:`utilities`, various utilities that come with the |Coq| distribution are presented.
ja: 次に、 :ref:`utilities` の章で、 |Coq| ディストリビューションに付属する様々なユーティリティについて説明します。

source: There are currently two ways to introduce primitive records types:
ja: 今のところプリミティブレコード型を導入するには二つの方法があります。

source: There are several commands that specify which variables should be generalizable.
ja: どの変数が一般化されるべきかを指定するコマンドがいくつかあります。

source: There is a global index, and a number of specific indexes for tactics, vernacular commands, and error messages and warnings.
ja: 総合索引に加え、タクティックやコマンド、エラーメッセージ・警告に特化した索引があります。

source: There is currently no way to input unfolded primitive projections at the user-level, and one must use the :flag:`Printing Primitive Projection Compatibility` to display unfolded primitive projections as matches and distinguish them from folded ones.
ja: 現在のところはユーザレベルで非畳み込みプリミティブ射影を入力する方法は無く、非畳み込みプリミティブ射影をマッチとして表示し、それらを畳み込みのそれと区別するには :flag:`Printing Primitive Projection Compatibility` を使わなければなりません。

source: There may be three reasons:
ja: 3通りの可能性があります。

source: These constants are used when elaborating partial applications of the projection.
ja: これらの定数はその射影の部分適用の精緻化のときに使われます。

source: These instances are used just as well as lemmas in the instance hint database.
ja: これらのインスタンスはインスタンスヒントデータベースの中の補題だけでなく使われます。

source: These kind of record types differ from their traditional versions in the sense that dependent elimination is not available for them and only non-dependent case analysis can be defined.
ja: これらの種類のレコード型は、依存除去が出来ず、非依存場合分けのみが定義できるという意味での伝統的なバージョンとは異なります。

source: These may be used as parts of other classes:
ja: これらは他のクラスの一部として使うことが出来ます。

source: These projection functions are given the names of the corresponding fields.
ja: これらの射影関数は対応するフィールド名から与えられます。

source: These proofs are: proofs that each recursive call is actually decreasing with respect to the given criteria, and (if the criteria is `wf`) a proof that the ordering relation is well-founded.
ja: これらの証明は: 各再帰呼び出しが実際に与えられた基準に照らして減少することの証明であり、そして (もしその基準が `wf` ならば) その順序関係は整礎である証明です。

source: They also support implicit quantification on :ref:`superclasses`.
ja: それらは :ref:`superclasses` に於ける暗黙の量化もサポートします。

source: They are explained in more details in :cite:`CSwcu`.
ja: それらは :cite:`CSwcu` の中でより詳細に説明されています。

source: They automatically set the maximally implicit status for typeclass arguments, making derived functions as easy to use as class methods.
ja: それらは型クラスの引数の状態を自動的に最大限暗黙に設定し、クラスメソッドのように簡単に使える派生関数を作ります。

source: They often arise when using classes for logical properties, e.g.:
ja: それらは論理的性質のためにクラスを使うときにたびたび現れます。例:

source: They support implicit quantification on partially applied type classes (:ref:`implicit-generalization`).
ja: それらは部分適用された型クラスの暗黙的な量化をサポートします (:ref:`implicit-generalization`)。

source: This allows to precisely mimic the usual unfolding rules of constants.
ja: これは通常の定数の展開規則と細部に渡って似ています。

source: This allows us to follow the same pattern and naming convention for the rest of the chapter.
ja: これによってこの章のこれ以降では同じパターンと命名規則に従うことが出来ます。

source: This also provides more control on the triggering of instances.
ja: これはインスタンスを持ち出すことに関して更なる制御性を提供します。

source: This can additionally speed up proof search as the typeclass map can be indexed by such rigid constants (see :ref:`thehintsdatabasesforautoandeauto`).
ja: これはさらにそのような固定的な定数によってインデックス出来る型クラスマップによって証明探索を高速化出来ます (see :ref:`thehintsdatabasesforautoandeauto`)。

source: This can be changed by unsetting the :flag:`Printing Primitive Projection Parameters` flag.
ja: これは :flag:`Printing Primitive Projection Parameters` フラグをアンセットすることで変更できます。

source: This can be expensive as it requires rebuilding hint clauses dynamically, and does not benefit from the invertibility status of the product introduction rule, resulting in potentially more expensive proof-search (i.e. more useless backtracking).
ja: これはヒント節の動的な再構築を要求するため高価になりえます、そして積の導入規則の反転可能性から恩恵を得られず、結果として証明探索がより高価になる (つまり、よりバックトラッキングが役に立たなくなる) 可能性があります 。

source: This can be read in the line declaring the canonical structure ``nat_EQty``, where the first argument to ``Pack`` is the key and its second argument a group of canonical values associated to the key.
ja: これは正準構造 ``nat_EQty`` を定義した行の中で読み取ることが出来、ここで ``Pack`` の最初の引数がキーであり、二番目の引数がそのキーに関連付けられた正準値のグループです。

source: This can be used in :cmd:`Hint Extern`’s for typeclass instances (in the hint database ``typeclass_instances``) to allow backtracking on the typeclass subgoals created by the lemma application, rather than doing typeclass resolution locally at the hint application time.
ja: これは :cmd:`Hint Extern` の中で (ヒントデータベース ``typeclass_instances`` の中の) 型クラスインスタンスのために、ヒントの適用時にローカルに型クラス解決を行うよりむしろ補題の適用によって作られた型クラスサブゴール上でバックトラッキングを許すために使うことができます。

source: This can be useful to make instances of existing objects easily and to reduce proof size by not inserting useless projections.
ja: これは簡単に既存のオブジェクトのインスタンスを作り、そして無駄な射影を挿入しないことで証明サイズを縮小するのに便利です。

source: This can drastically improve performance by calling unification less often, matching syntactic patterns being very quick.
ja: これは単一化を呼ぶ頻度が低くなることで劇的にパフォーマンスを改善でき、構文的パターンへのマッチングが非常に高速になります。

source: This can result in quite different performance behaviors of proof search.
ja: これは極めて異なった証明探索の性能挙動を示します。

source: This chapter explains the basics of canonical structures and how they can be used to overload notations and build a hierarchy of algebraic structures.
ja: この章では正準構造の基本とそれらが記法のオーバーロードや代数構造の階層の構築にどのように使えるかを説明します。

source: This chapter presents a quick reference of the commands related to type classes.
ja: この章では型クラスに関連したコマンドのクイックリファレンスを提供します。

source: This class implements a boolean equality test which is compatible with Leibniz equality on some type.
ja: このクラスはいくつかの型上での Leibniz 等値性と互換性があるような真偽値等値性テストを実装しています。

source: This command adds an arbitrary list of constants whose type ends with an applied typeclass to the instance database with an optional priority.
ja: このコマンドは定数の任意のリストを任意に優先度を伴ってインスタンスデータベースへ追加します。その型は適用された型クラスで終わります。

source: This command allows more global customization of the typeclass resolution tactic.
ja: このコマンドは型クラス解決タクティックのより広範囲のカスタマイズを行います。

source: This command also accepts an optional output filename:
ja: このコマンドはオプショナルな出力ファイル名も受け付けます。

source: This command can be seen as a generalization of ``Fixpoint``.
ja: このコマンドは ``Fixpoint`` の一般化と見なすことができます。

source: This command declares :token:`qualid` as a canonical structure.
ja: このコマンドは :token:`qualid` を正準構造として定義します。

source: This command makes the identifiers transparent during typeclass resolution.
ja: このコマンドは型クラス解決の間識別子を透明にします。

source: This compatibility option (on by default) governs the printing of pattern matching over primitive records.
ja: この互換性オプション (デフォルトで有効) はプリミティブレコード上でのパターンマッチの表示を抑制します。

source: This compatibility option reconstructs internally omitted parameters at printing time (even though they are absent in the actual AST manipulated by the kernel).
ja: この互換オプションは表示時に内部的に省略されたパラメータを再構成します (たとえばそれらがカーネルに操作された実際のASTには存在しないものであっても)。

source: This declaration means that any instance of the ``Ord`` class must have an instance of ``EqDec``.
ja: この定義が意味するところは ``Ord`` クラスのインスタンスは ``EqDec`` のインスタンスを持っていなければならないということです。

source: This declares singleton classes for reflexive and transitive relations, (see the :ref:`singleton class <singleton-class>` variant for an explanation).
ja: これは反射的および推移的関係のシングルトンクラスを宣言します (説明は :ref:`singleton class <singleton-class>` 派生を見てください)。

source: This displays the list of global names that are components of some canonical structure.
ja: これはいくつかの正準構造のコンポーネントのグローバルな名前のリストを表示します。

source: This document is the Reference Manual of the |Coq| proof assistant.
ja: この文書は証明アシスタント |Coq| のリファレンスマニュアルです。

source: This ensures that the resolution is canonical, but can make proof search much more expensive.
ja: これはその解が正準であることを保証しますが、証明探索はより高価になりえます。

source: This error happens generally when:
ja: このエラーは一般的に起こります:

source: This is a Reference Manual, so it is not intended for continuous reading.
ja: この文書はリファレンスマニュアルであり、通読するものではありません。

source: This is equivalent to ``Hint Resolve ident : typeclass_instances``, except it registers instances for :cmd:`Print Instances`.
ja: これは :cmd:`Print Instances` できるインスタンスを登録することを除いて ``Hint Resolve ident : typeclass_instances`` に相当します。

source: This is equivalent to ``Hint Transparent, Opaque ident : typeclass_instances``.
ja: これは ``Hint Transparent, Opaque ident : typeclass_instances`` に相当します。(訳注: 相当しません)

source: This is equivalent to a regular definition of :token:`ident` followed by the declaration :n:`Canonical Structure @ident`.
ja: これは :token:`ident` の通常の定義に続いて :n:`Canonical Structure @ident` を定義したのと等しくなります。

source: This is similar to the distinction between :cmd:`Parameter` vs. :cmd:`Definition`, or between :cmd:`Declare Module` and :cmd:`Module`.
ja: これは :cmd:`Parameter` と :cmd:`Definition` または :cmd:`Declare Module` と :cmd:`Module` の差異に似ています。

source: This is the default behavior.
ja: これはデフォルトの振る舞いです。

source: This is useful for declaring the implicit type of a single variable.
ja: これは単一の変数の暗黙型を定義するのに有効です。

source: This is very similar to the coercion mechanism of ``Structure`` declarations.
ja: これは ``Structure`` 定義のコアーション機構に非常に似ています。

source: This last test shows that |Coq| is now not only able to type check ``3 == 3``, but also that the infix relation was bound to the ``nat_eq`` relation.
ja: この最後のテストは |Coq| がもはや ``3 == 3`` の型検査が出来るだけでなく、中置関係が ``nat_eq`` 関係に束縛されたことを示しています。

source: This latter papers also presents many techniques one can employ to tune the inference of canonical structures.
ja: 後者の論文は正準構造の推論を調整するために用いることが出来るたくさんのテクニックも述べています。

source: This manual does not contain all the documentation the user may need about |Coq|.
ja: このマニュアルは |Coq| についてユーザが求める文書が全て含まれているわけではありません。

source: This material (the Coq Reference Manual) may be distributed only subject to the terms and conditions set forth in the Open Publication License, v1.0 or later (the latest version is presently available at http://www.opencontent.org/openpub).
ja: この作品 (Coq リファレンスマニュアル) はオープン・パブリケーション利用許諾契約書 (v1.0 かそれ以降) で指定された条件と制約に従う限り配布することができる(契約書の最新の版は現在のところ http://www.opencontent.org/openpub/で入手可能である)。

source: This may result in confusing errors in case of typos.
ja: これはtypoした場合に紛らわしいエラーにつながるかもしれません。

source: This message is followed by an explanation of this impossibility.
ja: このメッセージにはこの不可能性の説明が続きます。

source: This option (on by default since 8.6) respects the dependency order between subgoals, meaning that subgoals on which other subgoals depend come first, while the non-dependent subgoals were put before the dependent ones previously (Coq 8.5 and below).
ja: このオプション (8.6 からデフォルトで有効になった) はサブゴール間の依存順序を遵守し、その意味するところは、以前 (Coq 8.5 以下) では他のサブゴールが依存するサブゴールが優先され、一方非依存サブゴールは依存するもの前に置かれるということです。

source: This option (on by default) controls the ability to apply hints while avoiding (functional) eta-expansions in the generated proof term.
ja: このオプション (デフォルトで有効) は一般的な証明項の中で (関数的な) イータ展開を避けながらヒントを適用する能力を制御します。

source: This option (on by default) controls the use of typeclass resolution when a unification problem cannot be solved during elaboration/type inference.
ja: このオプション (デフォルトで有効) は精緻化/型推論の間に単一化問題が解決できない時に型クラス解決の使用を制御します。

source: This option allows to switch the behavior of instance declarations made through the Instance command.
ja: このオプションは Instance コマンドを通じて行われるインスタンス宣言の振る舞いの切り替えるを認めます。

source: This option, available since Coq 8.6 and off by default, switches the hint application procedure to a filter-then-unify strategy.
ja: このオプションは Coq 8.6 から使用可能でデフォルトで無効にされており、ヒント適用手続き filter-then-unify 戦略に切り替えます。

source: This relation is selected whenever ``==`` is used on terms of type nat.
ja: この関係は ``==`` が nat 型の項の上で使われるときはいつでも選択されます。

source: This singleton class is a so-called definitional class, represented simply as a definition ``ident binders := term`` and whose instances are themselves objects of this type.
ja: このシングルトンクラスはいわゆる定義クラスといわれ、``ident binders := term`` という定義として単純に表現され、そのインスタンスはこの型のオブジェクトそれ自体です。

source: This syntax can also be used for pattern matching.
ja: この構文はパターンマッチングに使うこともできます。

source: This syntax is used for declaration of singleton class instances or for directly giving an explicit term of type ``forall binders, Class t1 … tn``.
ja: この構文はシングルトンクラスインスタンスの宣言または ``forall binders, Class t1 … tn`` 型の明示的な項を直接与えるために使われます。

source: This tactic uses a different resolution engine than :tacn:`eauto` and :tacn:`auto`.
ja: このタクティックは :tacn:`eauto` や :tacn:`auto` と異なる(訳注: 制約)解消エンジンを使います。

source: This variant declares a *singleton* class with a single method.
ja: この類型は単一のメソッドを持つ *シングルトン* クラスを定義します。

source: This variant declares a class a posteriori from a constant or inductive definition.
ja: この派生形は定数や帰納的定義から事後的にクラスを定義します。

source: This variant runs resolution with the given hint databases.
ja: この派生形は与えられたヒントデータベースでの解消を実行します。

source: This wizard option, in combination with :flag:`Printing All` can help to diagnose failures to unify terms apparently identical but internally different in the Calculus of Inductive Constructions.
ja: この達人向けオプションは、:flag:`Printing All` と組み合わせて一見したところ同じだが Calculus of Inductive Constructions では内部的に異なっている項の単一化の失敗を診断するのに役立ちます。

source: Through the ``Inductive`` and ``CoInductive`` commands, when the body of the definition is a record declaration of the form ``Build_``\ `R` ``{`` |p_1| ``:`` |t_1|\ ``; … ;`` |p_n| ``:`` |t_n| ``}``.
ja: ``Inductive`` と ``CoInductive`` コマンドを使うのは、定義のボディーが ``Build_``\ `R` ``{`` |p_1| ``:`` |t_1|\ ``; … ;`` |p_n| ``:`` |t_n| ``}`` という形のレコード定義の時です。

source: Through the ``Record`` command, in which case the type has to be non-recursive.
ja: ``Record`` コマンドを使うと、その場合はその型が非再帰的である必要があります。

source: Thus the order of the fields is important.
ja: 従ってフィールドの順序は重要です。

source: Thus, the following example cannot be accepted due to the presence of partial application of `wrong` in the body of `wrong` :
ja: 従って、以下の例は `wrong` のボディー内の `wrong` の部分適用の存在のため受け入れられません:

source: To apply a hint, we first check that the goal *matches* syntactically the inferred or specified pattern of the hint, and only then try to *unify* the goal with the conclusion of the hint.
ja: ヒントを適用するため、まずそのゴールが推論やそのヒントによって指定されたパターンに構文的に *マッチする* かを検査し、そうなってはじめてそのヒントの結論とゴールを *単一化* しようと試みます。

source: To build an object of type :n:`@ident`, one should provide the constructor :n:`@ident₀` with the appropriate number of terms filling the fields of the record.
ja: :n:`@ident` 型のオブジェクトを構築するには、レコードのフィールドを埋める適切な数の項を伴った :n:`@ident₀` コンストラクタを提供する必要があります。

source: To define recursive records, one can use the ``Inductive`` and ``CoInductive`` keywords, resulting in an inductive or co-inductive record.
ja: 再帰的レコードを定義するためには、``Inductive`` と ``CoInductive`` キーワードを使うことができ、結果は帰納的または余帰納的レコードになります。
